Домашняя работа
Для задач Easy и Normal использовать данные Титаника

Easy
Оценить с помощью доверительных интервалов:

выживаемость всех пассажиров (оценить среднее по isSurvived)
выживаемость женщин
выживаемость людей с каютами первого класса
Ответить на вопросы:

какой вариант оценки доверительных интервалов нужно использовать в данной задаче и почему?
какая из ошибок более критична для данной задачи - I или II рода?

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import scipy
import scipy.stats
from statsmodels.stats.proportion import proportions_ztest
import scipy.special

In [4]:
titanic_df = pd.read_csv('train.csv')
df = pd.read_csv('gender_submission.csv')
tsd = pd.read_csv('test.csv')

In [16]:
titanic_df.pivot_table(values='Name',index='Pclass',aggfunc='count')

        Name
Pclass
1        216
2        184
3        491

In [17]:
titanic_df.pivot_table(values='Survived',index='Pclass',aggfunc=np.mean)

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [22]:
titanic_df.pivot_table(values='Survived',index=['Sex'],aggfunc=np.mean)

        Survived
Sex
female  0.742038
male    0.188908

Normal
Проверить гипотезу о том, что женщины выживают чаще мужчин с уровнем значимости 0.05
Проверить гипотезу о том, что дети выживают чаще, чем взрослые

In [6]:
H0_mean = titanic_df[titanic_df["Sex"]=='female']["Survived"].mean()

result = scipy.stats.ttest_1samp(titanic_df[titanic_df["Sex"]=='male']["Survived"], H0_mean, alternative="greater")
result   #Женщины выживают чаще

Ttest_1sampResult(statistic=-33.91393230463904, pvalue=1.0)

In [7]:
H0_mean = titanic_df[titanic_df["Age"]<18]["Survived"].mean()

result  = scipy.stats.ttest_1samp(titanic_df[titanic_df["Age"]>=18]["Survived"], H0_mean, alternative="greater") 
result   #Дети выживают чаще

Ttest_1sampResult(statistic=-8.009176230313653, pvalue=0.999999999999997)